In [1]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [3]:
target= df.Survived
inputs= df.drop('Survived',axis='columns')

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs= pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [11]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test= train_test_split(inputs,target,test_size=0.2)

In [12]:
len(X_train)

712

In [13]:
len(X_test)

179

In [14]:
len(inputs)

891

In [15]:
from sklearn.naive_bayes import GaussianNB
model= GaussianNB()

In [16]:
model.fit(X_train,y_train)

GaussianNB()

In [17]:
model.score(X_test,y_test)

0.7318435754189944

In [18]:
X_test[:10]

     Pclass        Age      Fare  female  male
477       3  29.000000    7.0458       0     1
716       1  38.000000  227.5250       1     0
596       2  29.699118   33.0000       1     0
256       1  29.699118   79.2000       1     0
469       3   0.750000   19.2583       1     0
87        3  29.699118    8.0500       0     1
38        3  18.000000   18.0000       1     0
677       3  18.000000    9.8417       1     0
856       1  45.000000  164.8667       1     0
607       1  27.000000   30.5000       0     1

In [19]:
y_test[:10]

477    0
716    1
596    1
256    1
469    1
87     0
38     0
677    1
856    1
607    1
Name: Survived, dtype: int64

In [20]:
model.predict(X_test[:10])

array([0, 1, 1, 1, 1, 0, 1, 1, 1, 0], dtype=int64)

In [21]:
model.predict_proba(X_test[:10])

array([[9.91546322e-01, 8.45367827e-03],
       [7.75202603e-12, 1.00000000e+00],
       [1.13103870e-02, 9.88689613e-01],
       [5.51651257e-04, 9.99448349e-01],
       [1.57469156e-02, 9.84253084e-01],
       [9.91661387e-01, 8.33861306e-03],
       [2.51517183e-02, 9.74848282e-01],
       [2.50197101e-02, 9.74980290e-01],
       [1.76523853e-07, 9.99999823e-01],
       [9.21491621e-01, 7.85083794e-02]])